<?php  

// Напишете програма, която отпечатва в браузъра таблица с две колони и N реда
//Първата колона съдържа случайно четно число в интервала 0 до 100, 
//а втората колона трябва да съдържа квадратния корен на това число, 
//с точност до втория знак след десетичната запетая. 
//Последния ред от таблицата трябва да съдържа сумата на всички квадратни корени.
$n = 10;
$sum = 0;
?>
<table border="1">
	<?php 
	for ( $i = 0; $i < $n; ) { 
		$num = rand(0, 100);	
		if ( $num % 2 == 0 ) {
			echo "<tr>";
				echo "<td>" . $num . "</td>";
				$sqrt = sqrt( $num );
				$rounded = round( $sqrt, 2 );
				echo "<td>" . $rounded . "</td>";
				$i++;
				$sum += $rounded;
				//$sum = $sum + $rounded
			echo "</tr>";
		}
	}
	?>
	<tr>
		<td>Sum of numbers` square roots</td>
		<td><?php echo $sum;?></td>
	</tr>
</table>