// Напишете JavaScript програма, която създава масив от 20
//елемента, като стойността на всеки елемент се получава от
//индекса му, умножен по 5
// let arr = [];
//
// for(let i = 0; i < 20; i++){
//     arr.push(i * 5);
// }
//
// console.log(arr);
//
//Напишете JavaScript програма, която намира елемента с
//максимална и елемента с минимална стойност и ги отпечатва в
//конзолата по показания начин. Не използвайте готови функции.
var arr = [1, 5, -1, 15, 20, 5, 7, 50],
    min,
    max;

min = arr[0];
max = arr[0];

for(let i = 1; i < arr.length; i++){
    if(arr[i] < min){
        min = arr[i];
    }

    if(arr[i] > max){
        max = arr[i];
    }
}

console.log(min, max);
